openlab.org
#+TITLE:  OpenLab: open tools for physicists
#+AUTHOR: Andrea Miglietta
#+EMAIL:  andrea.miglietta92@gmail.com
#+DATE:   2017.05.10

* Introduction
** Presentation of me:
   - Who I am?
   - My contacts:
      1. andrea.miglietta92@gmail.com
      2. andreatsh@lcm.mi.infn.it
   - GitHub: https://github.com/andreatsh/openlab
** Goals of this conference:
   Why using command line?
   Why bother?
   Why do I have to waste my time to learn command line?

   When you realize that you spend most of your time doing repetitive tasks, you
   could suspect you are not doing things quite well. What you want is a way to
   perform repetitive tasks with less typing and actions as possible.
   Stop waste your time with boring routine stuff!

   Moreover, you can have a good comprehension and a fine control of what you
   are actually doing. There are lots of tasks you can perfom easily with
   command line that in other way are particular complicated.
   If you do not believe it, try to implement a program (for example in C++)
   that:
   - search all your files into a directory
   - evaluate the disk space occupied by each file
   - order by size the results
   - print them on a file

   Once you have done, compare the time spent and the length of your code with
   this simple line:
   #+BEGIN_SRC bash
   du -sh * | sort -nr > file.results
   #+END_SRC
   If you are not convinced yet, please teach me your way to code in C++!
   Seriously!
** Quick review of things I'd like to assume you know:
*** Open a terminal
*** Open a file with an editor of your choice
    Choose your tools wisely and spend time to customize them.
    There are many text editor, some example:
**** Emacs, Vim
     Advanced and powerful editors. (Recommended)
**** Nano
**** Gedit
*** Elementary commands:
    - cd
    - ls
    - cp
    - mv
    - rm
    - mkdir
*** Standard input, output and error
**** >
     Redirect stdout to a file.
     Creates the file if not present, otherwise overwrites it.
**** >>
     Redirect stdout to a file.
     Creates the file if not present, otherwise appends to it.
**** 1>
     Redirect stdout
**** 1>>
     Redirect and append stdout
**** 2>
     Redirect stderr
**** 2>>
     Redirect and append stderr
**** &>
     Redirect both stdout and stderr
**** 2>&1
     Redirect both stdout and stderr
**** What is /dev/null?
*** Difference between absolute and relative path
*** How to get help?
**** man [command]
     Show the complete manual page of the command
**** --help, -h
     These flags are provided by almost every commands and show the basic usage
**** GIYF
     Google Is Your Friend
** How can I improve my skills?
   A lot of study and practice, practice and practice again!
   There are no other ways to gain confidence with command line.
   More confidence you have, less time you spend on silly routine tasks!
* Start learning Bash
** What is Bash?
   Bash is a Unix shell and command language.
** Why using Bash?
   Bash is the standard GNU shell. It's the default shell on most Linux
   distributions, so your script will virtually works everywhere.
   Bash is intuitive for beginner users and at the same time is a powerful tool
   for advavenced and professional users.
*** How to verify which shell you are using?
    There are many shells available (bash, sh, zsh, ksh, fish, etc..).
    Typing commands for a shell when you are running another one can cause
    confusion, errors or unwanted behaviors.
    To identify your default shell open a terminal and type:
    #+BEGIN_SRC bash
    echo "$SHELL"
    #+END_SRC
    /bin/bash
** Bash scripting
