openlab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>OpenLab: open tools for physicists</title>
<!-- 2017-05-10 Wed 14:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Andrea Miglietta" />
</head>
<body>
<div id="content">
<h1 class="title">OpenLab: open tools for physicists</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. Presentation of me:</a></li>
<li><a href="#sec-1-2">1.2. Goals of this conference:</a></li>
<li><a href="#sec-1-3">1.3. Quick review of things I'd like to assume you know:</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Open a terminal</a></li>
<li><a href="#sec-1-3-2">1.3.2. Open a file with an editor of your choice</a></li>
<li><a href="#sec-1-3-3">1.3.3. Elementary commands:</a></li>
<li><a href="#sec-1-3-4">1.3.4. Standard input, output and error</a></li>
<li><a href="#sec-1-3-5">1.3.5. Difference between absolute and relative path</a></li>
<li><a href="#sec-1-3-6">1.3.6. How to get help?</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. How can I improve my skills?</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Start learning Bash</a>
<ul>
<li><a href="#sec-2-1">2.1. What is Bash?</a></li>
<li><a href="#sec-2-2">2.2. Why using Bash?</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. How to verify which shell you are using?</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Bash scripting</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. What is a script?</a></li>
<li><a href="#sec-2-3-2">2.3.2. How can I run my script?</a></li>
<li><a href="#sec-2-3-3">2.3.3. First step: Hello World!</a></li>
<li><a href="#sec-2-3-4">2.3.4. Why is important quoting variables?</a></li>
<li><a href="#sec-2-3-5">2.3.5. Command substitutuion: backticks vs $()</a></li>
<li><a href="#sec-2-3-6">2.3.6. Why is dangerous shell scripting?</a></li>
<li><a href="#sec-2-3-7">2.3.7. Use bashisms: use Bash, don't half-use it.</a></li>
<li><a href="#sec-2-3-8">2.3.8. How to debug a script:</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. 7 personal advice to write a good script:</a></li>
</ul>
</li>
<li><a href="#sec-3">3. One step further: how to schedule our operations</a>
<ul>
<li><a href="#sec-3-1">3.1. Cron:</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. What is cron?</a></li>
<li><a href="#sec-3-1-2">3.1.2. How can I schedule use cron?</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Systemd timers:</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. What is a systemd timer?</a></li>
<li><a href="#sec-3-2-2">3.2.2. How can I create a timer?</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Exercises:</a></li>
</ul>
</li>
<li><a href="#sec-4">4. How to 'rename' large number of files?</a></li>
<li><a href="#sec-5">5. How to 'find' and do operations over multiple files?</a></li>
<li><a href="#sec-6">6. Text processing by examples: awk</a>
<ul>
<li>
<ul>
<li><a href="#sec-6-0-1">6.0.1. The worst thing you can do with Awk! (imho)</a></li>
<li><a href="#sec-6-0-2">6.0.2. Print lines based on pattern</a></li>
<li><a href="#sec-6-0-3">6.0.3. Print lines in range</a></li>
<li><a href="#sec-6-0-4">6.0.4. Remove (non consecutive) duplicated lines</a></li>
<li><a href="#sec-6-0-5">6.0.5. Find and replace</a></li>
<li><a href="#sec-6-0-6">6.0.6. Print intersection of two files</a></li>
<li><a href="#sec-6-0-7">6.0.7. Parse a CSV file</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. Project example: dice rolling simulations</a></li>
<li><a href="#sec-8">8. Not covered by this talk but truly useful and important:</a>
<ul>
<li><a href="#sec-8-1">8.1. ssh</a>
<ul>
<li><a href="#sec-8-1-1">8.1.1. Generate public/private key pair for authentication</a></li>
<li><a href="#sec-8-1-2">8.1.2. Basic configuration example</a></li>
</ul>
</li>
<li><a href="#sec-8-2">8.2. git</a></li>
<li><a href="#sec-8-3">8.3. tmux</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Presentation of me:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Who I am?
</li>
<li>My contacts:
<ol class="org-ol">
<li>andrea.miglietta92@gmail.com
</li>
<li>andreatsh@lcm.mi.infn.it
</li>
</ol>
</li>
<li>GitHub: <a href="https://github.com/andreatsh/openlab">https://github.com/andreatsh/openlab</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Goals of this conference:</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Why using command line?
Why bother?
Why do I have to waste my time to learn command line?
</p>

<p>
When you realize that you spend most of your time doing repetitive tasks, you
could suspect you are not doing things quite well. What you want is a way to
perform repetitive tasks with less typing and actions as possible.
Stop waste your time with boring routine stuff!
</p>

<p>
Moreover, you can have a good comprehension and a fine control of what you
are actually doing. There are lots of tasks you can perfom easily with
command line that in other way are particular complicated.
If you do not believe it, try to implement a program (for example in C++)
that:
</p>
<ul class="org-ul">
<li>search all your files into a directory
</li>
<li>evaluate the disk space occupied by each file
</li>
<li>order by size the results
</li>
<li>print them on a file
</li>
</ul>

<p>
Once you have done, compare the time spent and the length of your code with
this simple line:
</p>
<div class="org-src-container">

<pre class="src src-bash">du -sh * | sort -nr &gt; file.results
</pre>
</div>
<p>
If you are not convinced yet, please teach me your way to code in C++!
Seriously!
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Quick review of things I'd like to assume you know:</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Open a terminal</h4>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Open a file with an editor of your choice</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Choose your tools wisely and spend time to customize them.
There are many text editor, some example:
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-3-2-1" name="sec-1-3-2-1"></a>Emacs, Vim<br  /><div class="outline-text-5" id="text-1-3-2-1">
<p>
Advanced and powerful editors. (Recommended)
</p>
</div>
</li>
<li><a id="sec-1-3-2-2" name="sec-1-3-2-2"></a>Nano<br  /></li>
<li><a id="sec-1-3-2-3" name="sec-1-3-2-3"></a>Gedit<br  /></li></ol>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Elementary commands:</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li>cd
</li>
<li>ls
</li>
<li>cp
</li>
<li>mv
</li>
<li>rm
</li>
<li>mkdir
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Standard input, output and error</h4>
<div class="outline-text-4" id="text-1-3-4">
</div><ol class="org-ol"><li><a id="sec-1-3-4-1" name="sec-1-3-4-1"></a>&gt;<br  /><div class="outline-text-5" id="text-1-3-4-1">
<p>
Redirect stdout to a file.
Creates the file if not present, otherwise overwrites it.
</p>
</div>
</li>
<li><a id="sec-1-3-4-2" name="sec-1-3-4-2"></a>&gt;&gt;<br  /><div class="outline-text-5" id="text-1-3-4-2">
<p>
Redirect stdout to a file.
Creates the file if not present, otherwise appends to it.
</p>
</div>
</li>
<li><a id="sec-1-3-4-3" name="sec-1-3-4-3"></a>1&gt;<br  /><div class="outline-text-5" id="text-1-3-4-3">
<p>
Redirect stdout
</p>
</div>
</li>
<li><a id="sec-1-3-4-4" name="sec-1-3-4-4"></a>1&gt;&gt;<br  /><div class="outline-text-5" id="text-1-3-4-4">
<p>
Redirect and append stdout
</p>
</div>
</li>
<li><a id="sec-1-3-4-5" name="sec-1-3-4-5"></a>2&gt;<br  /><div class="outline-text-5" id="text-1-3-4-5">
<p>
Redirect stderr
</p>
</div>
</li>
<li><a id="sec-1-3-4-6" name="sec-1-3-4-6"></a>2&gt;&gt;<br  /><div class="outline-text-5" id="text-1-3-4-6">
<p>
Redirect and append stderr
</p>
</div>
</li>
<li><a id="sec-1-3-4-7" name="sec-1-3-4-7"></a>&amp;&gt;<br  /><div class="outline-text-5" id="text-1-3-4-7">
<p>
Redirect both stdout and stderr
</p>
</div>
</li>
<li><a id="sec-1-3-4-8" name="sec-1-3-4-8"></a>2&gt;&amp;1<br  /><div class="outline-text-5" id="text-1-3-4-8">
<p>
Redirect both stdout and stderr
</p>
</div>
</li>
<li><a id="sec-1-3-4-9" name="sec-1-3-4-9"></a>What is /dev/null?<br  /></li></ol>
</div>
<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> Difference between absolute and relative path</h4>
</div>
<div id="outline-container-sec-1-3-6" class="outline-4">
<h4 id="sec-1-3-6"><span class="section-number-4">1.3.6</span> How to get help?</h4>
<div class="outline-text-4" id="text-1-3-6">
</div><ol class="org-ol"><li><a id="sec-1-3-6-1" name="sec-1-3-6-1"></a>man [command]<br  /><div class="outline-text-5" id="text-1-3-6-1">
<p>
Show the complete manual page of the command
</p>
</div>
</li>
<li><a id="sec-1-3-6-2" name="sec-1-3-6-2"></a>&#x2013;help, -h<br  /><div class="outline-text-5" id="text-1-3-6-2">
<p>
These flags are provided by almost every commands and show the basic usage
</p>
</div>
</li>
<li><a id="sec-1-3-6-3" name="sec-1-3-6-3"></a>GIYF<br  /><div class="outline-text-5" id="text-1-3-6-3">
<p>
Google Is Your Friend
</p>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> How can I improve my skills?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A lot of study and practice, practice and practice again!
There are no other ways to gain confidence with command line.
More confidence you have, less time you spend on silly routine tasks!
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Start learning Bash</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> What is Bash?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Bash is a Unix shell and command language.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Why using Bash?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Bash is the standard GNU shell. It's the default shell on most Linux
distributions, so your script will virtually works everywhere.
Bash is intuitive for beginner users and at the same time is a powerful tool
for advavenced and professional users.
</p>
</div>
<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> How to verify which shell you are using?</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
There are many shells available (bash, sh, zsh, ksh, fish, etc..).
Typing commands for a shell when you are running another one can cause
confusion, errors or unwanted behaviors.
To identify your default shell open a terminal and type:
</p>
<div class="org-src-container">

<pre class="src src-bash">echo "$SHELL"
</pre>
</div>
<p>
/bin/bash
</p>
</div>
</div>
</div>
