openlab.org
*** What is a script?
    Shell scripts are interpreted, not compiled. So in few words, a shell script
    is just a sequence of instructions that the shell reads from the script line
    by line and executes them.
**** Shebang: #!
*** How can I run my script?
**** Make a file executable
     The permissions of a file granted to a user are:
     - read (*r*)
     - write (*w*)
     - execute (*x*)
     You have to assign the execute attribute to your script:
     #+BEGIN_SRC bash
     chmod +x script.sh
     #+END_SRC
*** First step: Hello World!
**** A simple "Hello World!"
     #+BEGIN_SRC bash
     #!/bin/bash
     echo "Hello World!"
     #+END_SRC
**** Another simple "Hello World!"
     #+BEGIN_SRC bash
     #!/bin/bash
     # This is a variable
     HELLO="Hello World!"
     echo "$HELLO"
     #+END_SRC
*** Why is important quoting variables?
    It's a good practice to quote your variables.
**** Differences between using single quotes or double quotes
***** Example 1
      - Single quotes example:
        #+BEGIN_SRC sh
        echo 'This is my $HOME'
        #+END_SRC
        This is my $HOME
      - Double quotes example:
        #+BEGIN_SRC sh
        echo "This is my $HOME"
        #+END_SRC
        This is my /home/andreatsh
***** Example 2
      - Single quotes:
        #+BEGIN_SRC sh
        [ '$HOME' =='/home/andreatsh' ] && echo "Yuppi" || echo "Error"
        #+END_SRC
        Error
      - Example with double quotes:
        #+BEGIN_SRC sh
        [ "$HOME" == "/home/andreatsh" ] && echo "Yuppi" || echo "Error`"
        #+END_SRC
        Yuppi
**** A bit more advanced example:
     #+BEGIN_SRC bash
     #!/bin/bash

     # Personal example of why quoting is important.
     # What output do you expect? You might be surprised.
     HELLO=Hello!; ls -l
     echo "$HELLO"

     # This is a script designed to learn, you can run it and nothing bad will
     # happen. But if you do not write your script with care and good practices
     # (even on-the-fly scripts) can do real damages!
     #+END_SRC
*** Command substitutuion: backticks vs $()
**** From Bash manual page:
     #+BEGIN_QUOTE
     Command substitution allows the output of a command to replace the command
     name. There are two forms:
     #+END_QUOTE
     #+BEGIN_VERSE
         $(command)
     or
         `command`
     #+END_VERSE
     #+BEGIN_QUOTE
     Bash performs the expansion by executing command in a subshell environment
     and replacing the command substitution with the standard output of the
     command, with any trailing newlines deleted. Embedded newlines are not
     deleted, but they may be removed during word splitting.
     The command substitution $(cat file) can be  replaced by the equivalent but
     faster $(< file). \\

     When the old-style backquote form of substitution is used, backslash retains
     its literal meaning except when followed by $, `, or \. The first backquote
     not preceded by a backslash terminates the command substitution. When using
     the $(command) form, all  characters between the parentheses make up the
     command; none are treated specially. \\

     Command substitutions may be nested. To nest when using the backquoted form,
     escape the inner backquotes with backslashes. \\

     If the substitution appears within double quotes, word splitting and
     pathname expansion are not performed on the results.
     #+END_QUOTE
**** Examples:
     1. Simple use of command substitutuions:
        #+BEGIN_SRC sh
        ex1=`echo ciao`;  echo "$ex1"
        ex1=$(echo ciao); echo "$ex1"
        #+END_SRC
     2. Nested command substitutions:
        #+BEGIN_SRC sh
        ex2=`echo `ls``; echo "$ex2"    # WRONG!
        ex2=`echo \`ls\``; echo "$ex2"  # RIGHT
        ex2=$(echo $(ls)); echo "$ex2"  # RIGHT
        #+END_SRC
*** Why is dangerous shell scripting?
    Many reasons. An example is worth a thousand words:
    Example:
    #+BEGIN_SRC bash
    # This is an example of really bad code!
    MYDIR=
    rm -rf "$MYDIR/"*
    # MYDIR variable may not be defined or be an empty string for many reasons!
    # You just ran "rm -rf /*", maybe even as superuser!
    #+END_SRC
*** Use bashisms: use Bash, don't half-use it.
    - parameters expansions
    - local and readonly variables
    - improved conditional expressions
*** How to debug a script:
    I'm used to write very carefully my script, even on-the-fly or one-time
    scripts. However, there is always something that could be have undesired
    behaviors. To debug my Bash script I find useful this way to proceed:
    #+BEGIN_SRC bash
    # Debug mode: ON
    set -x
    # ...
    # Your script goes here!
    # ...
    # Debug mode: OFF
    set +x
    #+END_SRC
