openlab.html
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Bash scripting</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> What is a script?</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Shell scripts are interpreted, not compiled. So in few words, a shell script
is just a sequence of instructions that the shell reads from the script line
by line and executes them.
</p>
</div>
<ol class="org-ol"><li><a id="sec-2-3-1-1" name="sec-2-3-1-1"></a>Shebang: #!<br  /></li></ol>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> How can I run my script?</h4>
<div class="outline-text-4" id="text-2-3-2">
</div><ol class="org-ol"><li><a id="sec-2-3-2-1" name="sec-2-3-2-1"></a>Make a file executable<br  /><div class="outline-text-5" id="text-2-3-2-1">
<p>
The permissions of a file granted to a user are:
</p>
<ul class="org-ul">
<li>read (<b>r</b>)
</li>
<li>write (<b>w</b>)
</li>
<li>execute (<b>x</b>)
</li>
</ul>
<p>
You have to assign the execute attribute to your script:
</p>
<div class="org-src-container">

<pre class="src src-bash">chmod +x script.sh
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> First step: Hello World!</h4>
<div class="outline-text-4" id="text-2-3-3">
</div><ol class="org-ol"><li><a id="sec-2-3-3-1" name="sec-2-3-3-1"></a>A simple "Hello World!"<br  /><div class="outline-text-5" id="text-2-3-3-1">
<div class="org-src-container">

<pre class="src src-bash">#!/bin/bash
echo "Hello World!"
</pre>
</div>
</div>
</li>
<li><a id="sec-2-3-3-2" name="sec-2-3-3-2"></a>Another simple "Hello World!"<br  /><div class="outline-text-5" id="text-2-3-3-2">
<div class="org-src-container">

<pre class="src src-bash">#!/bin/bash
# This is a variable
HELLO="Hello World!"
echo "$HELLO"
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-2-3-4" class="outline-4">
<h4 id="sec-2-3-4"><span class="section-number-4">2.3.4</span> Why is important quoting variables?</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
It's a good practice to quote your variables.
</p>
</div>
<ol class="org-ol"><li><a id="sec-2-3-4-1" name="sec-2-3-4-1"></a>Differences between using single quotes or double quotes<br  /><ol class="org-ol"><li><a id="sec-2-3-4-1-1" name="sec-2-3-4-1-1"></a>Example 1<br  /><div class="outline-text-6" id="text-2-3-4-1-1">
<ul class="org-ul">
<li>Single quotes example:
<div class="org-src-container">

<pre class="src src-sh">echo 'This is my $HOME'
</pre>
</div>
<p>
This is my $HOME
</p>
</li>
<li>Double quotes example:
<div class="org-src-container">

<pre class="src src-sh">echo "This is my $HOME"
</pre>
</div>
<p>
This is my /home/andreatsh
</p>
</li>
</ul>
</div>
</li>
<li><a id="sec-2-3-4-1-2" name="sec-2-3-4-1-2"></a>Example 2<br  /><div class="outline-text-6" id="text-2-3-4-1-2">
<ul class="org-ul">
<li>Single quotes:
<div class="org-src-container">

<pre class="src src-sh">[ '$HOME' =='/home/andreatsh' ] &amp;&amp; echo "Yuppi" || echo "Error"
</pre>
</div>
<p>
Error
</p>
</li>
<li>Example with double quotes:
<div class="org-src-container">

<pre class="src src-sh">[ "$HOME" == "/home/andreatsh" ] &amp;&amp; echo "Yuppi" || echo "Error`"
</pre>
</div>
<p>
Yuppi
</p>
</li>
</ul>
</div>
</li></ol>
</li>
<li><a id="sec-2-3-4-2" name="sec-2-3-4-2"></a>A bit more advanced example:<br  /><div class="outline-text-5" id="text-2-3-4-2">
<div class="org-src-container">

<pre class="src src-bash">#!/bin/bash

# Personal example of why quoting is important.
# What output do you expect? You might be surprised.
HELLO=Hello!; ls -l
echo "$HELLO"

# This is a script designed to learn, you can run it and nothing bad will
# happen. But if you do not write your script with care and good practices
# (even on-the-fly scripts) can do real damages!
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-2-3-5" class="outline-4">
<h4 id="sec-2-3-5"><span class="section-number-4">2.3.5</span> Command substitutuion: backticks vs $()</h4>
<div class="outline-text-4" id="text-2-3-5">
</div><ol class="org-ol"><li><a id="sec-2-3-5-1" name="sec-2-3-5-1"></a>From Bash manual page:<br  /><div class="outline-text-5" id="text-2-3-5-1">
<blockquote>
<p>
Command substitution allows the output of a command to replace the command
name. There are two forms:
</p>
</blockquote>
<p class="verse">
&#xa0;&#xa0;&#xa0;&#xa0;$(command)<br  />
or<br  />
&#xa0;&#xa0;&#xa0;&#xa0;`command`<br  />
</p>
<blockquote>
<p>
Bash performs the expansion by executing command in a subshell environment
and replacing the command substitution with the standard output of the
command, with any trailing newlines deleted. Embedded newlines are not
deleted, but they may be removed during word splitting.
The command substitution $(cat file) can be  replaced by the equivalent but
faster $(&lt; file). <br  />
</p>

<p>
When the old-style backquote form of substitution is used, backslash retains
its literal meaning except when followed by $, `, or \. The first backquote
not preceded by a backslash terminates the command substitution. When using
the $(command) form, all  characters between the parentheses make up the
command; none are treated specially. <br  />
</p>

<p>
Command substitutions may be nested. To nest when using the backquoted form,
escape the inner backquotes with backslashes. <br  />
</p>

<p>
If the substitution appears within double quotes, word splitting and
pathname expansion are not performed on the results.
</p>
</blockquote>
</div>
</li>
<li><a id="sec-2-3-5-2" name="sec-2-3-5-2"></a>Examples:<br  /><div class="outline-text-5" id="text-2-3-5-2">
<ol class="org-ol">
<li>Simple use of command substitutuions:
<div class="org-src-container">

<pre class="src src-sh">ex1=`echo ciao`;  echo "$ex1"
ex1=$(echo ciao); echo "$ex1"
</pre>
</div>
</li>
<li>Nested command substitutions:
<div class="org-src-container">

<pre class="src src-sh">ex2=`echo `ls``; echo "$ex2"    # WRONG!
ex2=`echo \`ls\``; echo "$ex2"  # RIGHT
ex2=$(echo $(ls)); echo "$ex2"  # RIGHT
</pre>
</div>
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-2-3-6" class="outline-4">
<h4 id="sec-2-3-6"><span class="section-number-4">2.3.6</span> Why is dangerous shell scripting?</h4>
<div class="outline-text-4" id="text-2-3-6">
<p>
Many reasons. An example is worth a thousand words:
Example:
</p>
<div class="org-src-container">

<pre class="src src-bash"># This is an example of really bad code!
MYDIR=
rm -rf "$MYDIR/"*
# MYDIR variable may not be defined or be an empty string for many reasons!
# You just ran "rm -rf /*", maybe even as superuser!
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3-7" class="outline-4">
<h4 id="sec-2-3-7"><span class="section-number-4">2.3.7</span> Use bashisms: use Bash, don't half-use it.</h4>
<div class="outline-text-4" id="text-2-3-7">
<ul class="org-ul">
<li>parameters expansions
</li>
<li>local and readonly variables
</li>
<li>improved conditional expressions
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3-8" class="outline-4">
<h4 id="sec-2-3-8"><span class="section-number-4">2.3.8</span> How to debug a script:</h4>
<div class="outline-text-4" id="text-2-3-8">
<p>
I'm used to write very carefully my script, even on-the-fly or one-time
scripts. However, there is always something that could be have undesired
behaviors. To debug my Bash script I find useful this way to proceed:
</p>
<div class="org-src-container">

<pre class="src src-bash"># Debug mode: ON
set -x
# ...
# Your script goes here!
