openlab.org
** 7 personal advice to write a good script:
   I summarize here the main recommendations that will be used in this
   document. I think it's a good habit to use them all the time, even just
   for single time scripts. A well documented, structered and organized,
   versioned collection of scripts will bring you many benefits over time.

   1. Comment your code!
      Use comments to explain why are you doing something more than what
      you are doing, and write them in english! Do not underestimate the
      importance of english in writing code! You don't write production
      scripts for yourself! The whole team need to understand what you have
      done and why.

   2. Choose descriptive names for variables and functions!

   3. Try to write reliable and reusable code.
      In this way is easier to make changes and updates without break the
      application, and you can rearrange in a jiffy functions to fit your
      temporary needs instead of rewrite code from scratch.

   4. Don't use a complex construct where a simpler one will do.
      Complex construct are difficult to understand and decrease readability.

   5. Break complex scripts into simpler modules. Use functions where appropriate.

   6. Log what your script is doing!
      Make sure to always known what your scripts are doing.
      In my experience the correct way is to use standard error for logging,
      so you can redirect your simulation's output (i.e. your data) into a file
      without mix them with useful (and hopefully verbose) log messages.

   7. Last but not least: Keep your code under versioning!
      This is really important to me! Personally I keep under versioning even
      my filesystem configurations directories, like those in /etc.
      Making mistakes or having unwanted behavior is easy with shell scripts,
      as we will see soon in this document. A repository is really usefull to
      review your code and have structured logs of what you have done and
      bugs fixed.
* One step further: how to schedule our operations
  It's often useful run a script periodically, to do some cleanup, monitor a
  simulation, or backup your files. To take efficiency one step further, it
  would be nice if we could not sit in front of our computers and run these
  scritps manually. You can get this job done by using cron or systemd-timers.
  Here is a brief introduction to these topics.
** Cron:
*** What is cron?
    /cron/ is a daemon to execute scheduled commands.
*** How can I schedule use cron?
    Each user can have his own crontab file in /var/spool/cron/crontabs/,
    which can be created/modified/removed by /crontab/ command.
    The crontab file should not be accessed directly, the /crontab/ command
    should be used to access and update it.
    To edit (or create) your crontab:
    #+BEGIN_SRC bash
    crontab -e
    #+END_SRC
    To list your current crontab:
    #+BEGIN_SRC bash
    crontab -l
    #+END_SRC
    Use 'man cron' and 'man crontab' to find all the documentation you need.
** Systemd timers:
   This is an advanced topic for this conference. If you don't know what SystemD is, don't worry,
   you can skip this part without losing anything.
*** What is a systemd timer?
    Timers are systemd unit files with a suffix of /.timer/.
*** How can I create a timer?
    Let's say you have a script you want to run every hour.
    In /$HOME//.config/systemd/user/ you have to create two files: one is the
    the service file, the other is the timer file.
**** Create a service file
     We start creating a test.service file like this:
     #+BEGIN_SRC
     [Unit]
     Description=Simple test script

     [Service]
     Type=simple
     ExecStart=/home/andreatsh/bin/test.sh
     #+END_SRC
**** Create a timer file
     Now we create test.timer file:
     #+BEGIN_SRC
     [Unit]
     Description=Runs every minute
     RefuseManualStart=no
     RefuseManualStop=no

     [Timer]
     OnCalendar=*:0/1
     Unit=test.service

     [Install]
     WantedBy=timers.target
     #+END_SRC
**** Enable/Start service and timer
     #+BEGIN_SRC bash
     systemctl --user enable testscript.timer
     systemctl --user start testscript.timer
     #+END_SRC
** Exercises:
   1. Find a way to check periodically (for example every hour) your available
      disk space and send the result via email. For example, if your simulation
      do an heavy i/o on disk and you have a limited disk quota it's a good
      habit monitor it.
      Difficulty: Basic
      Estimated time to complete task: ~ 1 minute
* How to 'rename' large number of files?
  I have a large number of file I want to rename them,
  I can do that in a easy and fast way?
  #+BEGIN_SRC bash
  #!/bin/bash
  # Debian/Ubuntu version
  rename 's/pattern/replacement/' files
  # Fedora/CentOS version
  rename pattern replacement files
  #+END_SRC
* How to 'find' and do operations over multiple files?
  #+BEGIN_SRC bash
  for i in $(ls);
  do
    # Do something ..
  done
  #+END_SRC
  You don't have control on the output, ls does not distinguish between regular
  file or directory, or files with different permission.
  Sure, you can use a more complex command like
  #+BEGIN_SRC bash
  for i in $(ls -l | awk '/^-rwx-rw--x/{print $9}');
  do
    # Do something ..
  done
  #+END_SRC
  but is it worth? This is not an efficient way to do loop over file.
  It's always better use appropriate tools: for example I prefer a syntax like:
  #+BEGIN_SRC bash
  find /path/to/dir -type f -exec touch {} \;
  #+END_SRC
* Text processing by examples: awk
   Awk is a really useful tool for text processing. If you have to easily
   manipulate data organized in columns, strange format, or rearrange data
   based on pattern this is for you.
   Here you can find some basic examples that in my opinion show how much
   intuitive and powerful Awk is.
   These examples are deliberately more idiomatic than those that often you can
   learn from standard manuals, they want to be hints on how to write shorter
   and sometimes more efficient Awk programs.
