openlab.html
# ...
# Debug mode: OFF
set +x
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 7 personal advice to write a good script:</h3>
<div class="outline-text-3" id="text-2-4">
<p>
I summarize here the main recommendations that will be used in this
document. I think it's a good habit to use them all the time, even just
for single time scripts. A well documented, structered and organized,
versioned collection of scripts will bring you many benefits over time.
</p>

<ol class="org-ol">
<li>Comment your code!
Use comments to explain why are you doing something more than what
you are doing, and write them in english! Do not underestimate the
importance of english in writing code! You don't write production
scripts for yourself! The whole team need to understand what you have
done and why.
</li>

<li>Choose descriptive names for variables and functions!
</li>

<li>Try to write reliable and reusable code.
In this way is easier to make changes and updates without break the
application, and you can rearrange in a jiffy functions to fit your
temporary needs instead of rewrite code from scratch.
</li>

<li>Don't use a complex construct where a simpler one will do.
Complex construct are difficult to understand and decrease readability.
</li>

<li>Break complex scripts into simpler modules. Use functions where appropriate.
</li>

<li>Log what your script is doing!
Make sure to always known what your scripts are doing.
In my experience the correct way is to use standard error for logging,
so you can redirect your simulation's output (i.e. your data) into a file
without mix them with useful (and hopefully verbose) log messages.
</li>

<li>Last but not least: Keep your code under versioning!
This is really important to me! Personally I keep under versioning even
my filesystem configurations directories, like those in /etc.
Making mistakes or having unwanted behavior is easy with shell scripts,
as we will see soon in this document. A repository is really usefull to
review your code and have structured logs of what you have done and
bugs fixed.
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> One step further: how to schedule our operations</h2>
<div class="outline-text-2" id="text-3">
<p>
It's often useful run a script periodically, to do some cleanup, monitor a
simulation, or backup your files. To take efficiency one step further, it
would be nice if we could not sit in front of our computers and run these
scritps manually. You can get this job done by using cron or systemd-timers.
Here is a brief introduction to these topics.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Cron:</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> What is cron?</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<i>cron</i> is a daemon to execute scheduled commands.
</p>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> How can I schedule use cron?</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Each user can have his own crontab file in <i>var/spool/cron/crontabs</i>,
which can be created/modified/removed by <i>crontab</i> command.
The crontab file should not be accessed directly, the <i>crontab</i> command
should be used to access and update it.
To edit (or create) your crontab:
</p>
<div class="org-src-container">

<pre class="src src-bash">crontab -e
</pre>
</div>
<p>
To list your current crontab:
</p>
<div class="org-src-container">

<pre class="src src-bash">crontab -l
</pre>
</div>
<p>
Use 'man cron' and 'man crontab' to find all the documentation you need.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Systemd timers:</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This is an advanced topic for this conference. If you don't know what SystemD is, don't worry,
you can skip this part without losing anything.
</p>
</div>
<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> What is a systemd timer?</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Timers are systemd unit files with a suffix of <i>.timer</i>.
</p>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> How can I create a timer?</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Let's say you have a script you want to run every hour.
In <i>$HOME/</i>.config/systemd/user/ you have to create two files: one is the
the service file, the other is the timer file.
</p>
</div>
<ol class="org-ol"><li><a id="sec-3-2-2-1" name="sec-3-2-2-1"></a>Create a service file<br  /><div class="outline-text-5" id="text-3-2-2-1">
<p>
We start creating a test.service file like this:
</p>
<pre class="example">
[Unit]
Description=Simple test script

[Service]
Type=simple
ExecStart=/home/andreatsh/bin/test.sh
</pre>
</div>
</li>
<li><a id="sec-3-2-2-2" name="sec-3-2-2-2"></a>Create a timer file<br  /><div class="outline-text-5" id="text-3-2-2-2">
<p>
Now we create test.timer file:
</p>
<pre class="example">
[Unit]
Description=Runs every minute
RefuseManualStart=no
RefuseManualStop=no

[Timer]
OnCalendar=*:0/1
Unit=test.service

[Install]
WantedBy=timers.target
</pre>
</div>
</li>
<li><a id="sec-3-2-2-3" name="sec-3-2-2-3"></a>Enable/Start service and timer<br  /><div class="outline-text-5" id="text-3-2-2-3">
<div class="org-src-container">

<pre class="src src-bash">systemctl --user enable testscript.timer
systemctl --user start testscript.timer
</pre>
</div>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Exercises:</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>Find a way to check periodically (for example every hour) your available
disk space and send the result via email. For example, if your simulation
do an heavy i/o on disk and you have a limited disk quota it's a good
habit monitor it.
Difficulty: Basic
Estimated time to complete task: ~ 1 minute
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> How to 'rename' large number of files?</h2>
<div class="outline-text-2" id="text-4">
<p>
I have a large number of file I want to rename them,
I can do that in a easy and fast way?
</p>
<div class="org-src-container">

<pre class="src src-bash">#!/bin/bash
# Debian/Ubuntu version
rename 's/pattern/replacement/' files
# Fedora/CentOS version
rename pattern replacement files
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> How to 'find' and do operations over multiple files?</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-bash">for i in $(ls);
do
  # Do something ..
done
</pre>
</div>
<p>
You don't have control on the output, ls does not distinguish between regular
file or directory, or files with different permission.
Sure, you can use a more complex command like
</p>
<div class="org-src-container">

<pre class="src src-bash">for i in $(ls -l | awk '/^-rwx-rw--x/{print $9}');
do
  # Do something ..
done
</pre>
</div>
<p>
but is it worth? This is not an efficient way to do loop over file.
It's always better use appropriate tools: for example I prefer a syntax like:
</p>
<div class="org-src-container">

<pre class="src src-bash">find /path/to/dir -type f -exec touch {} \;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Text processing by examples: awk</h2>
<div class="outline-text-2" id="text-6">
<p>
Awk is a really useful tool for text processing. If you have to easily
manipulate data organized in columns, strange format, or rearrange data
based on pattern this is for you.
Here you can find some basic examples that in my opinion show how much
intuitive and powerful Awk is.
These examples are deliberately more idiomatic than those that often you can
learn from standard manuals, they want to be hints on how to write shorter
and sometimes more efficient Awk programs.
</p>
</div>
