openlab.org
*** The worst thing you can do with Awk! (imho)
    Suppose we want to read a file line-by-line, and we want to print the
    second column. You might be tempted to do something like:
    #+BEGIN_SRC bash
    # Example of bad code!
    while IFS= read -r line; do
        echo "$line" | awk '{ print $2 }'
    done < file
    #+END_SRC
    Why this is not a good idea? Awk is designed and optimized to read a file
    line-by-line and do operations on these lines. In this case you are calling
    an instance of Awk for each line of your file, it's a waste of resources and
    time! If you have to cut ten onions you take the knife, cut all the onions
    and then you wash the knife and put it away; in this case you are washing
    and putting the knife away after you have cut every single onion.
    The right way to do this task is:
    #+BEGIN_SRC bash
    awk '{ print $2 }' file
    #+END_SRC
    Note: Whenever is possible avoid loops in Bash!
*** Print lines based on pattern
    Let's say we simply want to print all lines in a file that match a pattern.
    Our first attempt might be something like that:
    #+BEGIN_SRC bash
    awk '{ if( $0 ~ /pattern/ ) print $0 }' file
    #+END_SRC
    This code works, but we can go further. If this is not the first time you
    use Awk, you know it works by definition in this way:
    #+BEGIN_SRC bash
    awk ' CONDITION_1 { ACTION_1 } ... CONDITION_N { ACTION_N} ' file
    #+END_SRC
    So the previous one-liner become:
    #+BEGIN_SRC bash
    awk ' $0 ~ /pattern/ { print $0 }' file
    #+END_SRC
    But it's not enough! We also know from theory that every regular expression
    is implicitly applied by Awk to $0; moreover, we know the default action
    applied to a true condition without specified actions is 'print' ($0 is a
    redundant option since 'print' alone by default print '$0').
    I omit all these working intermidiate steps and come to the point:
    #+BEGIN_SRC bash
    # This command emulates 'grep'
    awk '/pattern/' file
    #+END_SRC
    Really more readable and typing saving than our first try.

    And if you want to print all lines that does not match a pattern:
    #+BEGIN_SRC bash
    # This command emulates 'grep -v'
    awk '!/pattern/' file
    #+END_SRC
**** Exercises:
     1. Print lines that match both pattern1 AND pattern2
     2. Print lines that match pattern1 BUT NOT pattern2
*** Print lines in range
    #+BEGIN_SRC bash
     # NR: The total number of input records seen so far.
     # Print from line 3 to line 7 (inclusive)
     awk 'NR==3,NR==7'

     # Print lines between to regular expression (inclusive)
     awk '/beginregex/,/endregex/'

     # Print lines between to regular expression (not inclusive)
     awk '/endregex/{p=0}; p; /beginregex/{p=1}/
    #+END_SRC
**** Exercises:
     1. Print lines from beginregex to endregex, excluding beginregex.
     2. Print lines from beginregex to endregex, excluding endregex.
*** Remove (non consecutive) duplicated lines
    #+BEGIN_SRC bash
    awk '!z[$0]++' file
    #+END_SRC
**** Exercises:
     1. Remove duplicated lines only if these lines are consecutive.
        (Emulates uniq command)
*** Find and replace
    #+BEGIN_SRC bash
    # Find and replace only the first occurrence
    awk '{sub("pattern","replacement")} 1'
    # Find and replace all occurrences
    awk '{gsub("pattern","replacement")} 1'
    #+END_SRC
**** Exercises:
     1. Print only the lines where a replacement occurs.
*** Print intersection of two files
    This is a really common and powerful construct in Awk.
    #+BEGIN_SRC bash
    # Print only the lines that are both in file1 and file2
    awk 'FNR==NR{ z[$0]++; next } $0 in z' file1 file2
    #+END_SRC
*** Parse a CSV file
    #+BEGIN_SRC bash
    # With the flag -F you can set the Input Field Separator (IFS)
    # If the separator is comma "," you can write something like:
    awk -F, '{ print $1,$3 }' file.csv

    NOTE: In this case we have set IFS=, but when we print, as you already know,
    there are spaces between fields and not commas! This is not desirable if we,
    after some manipulation, want to have again a csv file as output.
    Sure, we can print explicitly all commas:
    awk -F, '{ print $1","$3 }' file.csv

    # However, this is not a good solution.
    # In many situation is preferable set the Output Field Separator (OFS):
    awk -F, '{ print $1,$3 }' OFS=, file.csv
    #+END_SRC
* Project example: dice rolling simulations
  I choose this example because it's simple and everyone has experience of
  dice rolling; moreover, I write the program in C++ because there are several
  courses that cover this language and I hope you are familiar with it.
  The C++ code I wrote is straightforward, so you can focus on:
  - how to pass different arguments to a program
  - how to redirect program's output to specific files
  - how to manipulate output files

  You can find the program's code in the /project:dice/ subfolder of this seminar
  repository. Compile. Run. An usage message should be returned:
  Usage: ./dice <dice number> <faces number> <rolls number>
* Not covered by this talk but truly useful and important:
** ssh
   Some tips to improve your experience.
*** Generate public/private key pair for authentication
    You can generate SSH keys with the command:
    #+BEGIN_SRC bash
    ssh-keygen
    #+END_SRC
    Once you have a key pair you have to append your public key in the file
    '~/.ssh/authorized_keys' on your remote host, you can do it manually or with
    the command:
    #+BEGIN_SRC bash
    ssh-copy-id -i ~/.ssh/id_rsa.pub user@domain
    #+END_SRC
