openlab.html
<div id="outline-container-sec-6-0-1" class="outline-4">
<h4 id="sec-6-0-1"><span class="section-number-4">6.0.1</span> The worst thing you can do with Awk! (imho)</h4>
<div class="outline-text-4" id="text-6-0-1">
<p>
Suppose we want to read a file line-by-line, and we want to print the
second column. You might be tempted to do something like:
</p>
<div class="org-src-container">

<pre class="src src-bash"># Example of bad code!
while IFS= read -r line; do
    echo "$line" | awk '{ print $2 }'
done &lt; file
</pre>
</div>
<p>
Why this is not a good idea? Awk is designed and optimized to read a file
line-by-line and do operations on these lines. In this case you are calling
an instance of Awk for each line of your file, it's a waste of resources and
time! If you have to cut ten onions you take the knife, cut all the onions
and then you wash the knife and put it away; in this case you are washing
and putting the knife away after you have cut every single onion.
The right way to do this task is:
</p>
<div class="org-src-container">

<pre class="src src-bash">awk '{ print $2 }' file
</pre>
</div>
<p>
Note: Whenever is possible avoid loops in Bash!
</p>
</div>
</div>
<div id="outline-container-sec-6-0-2" class="outline-4">
<h4 id="sec-6-0-2"><span class="section-number-4">6.0.2</span> Print lines based on pattern</h4>
<div class="outline-text-4" id="text-6-0-2">
<p>
Let's say we simply want to print all lines in a file that match a pattern.
Our first attempt might be something like that:
</p>
<div class="org-src-container">

<pre class="src src-bash">awk '{ if( $0 ~ /pattern/ ) print $0 }' file
</pre>
</div>
<p>
This code works, but we can go further. If this is not the first time you
use Awk, you know it works by definition in this way:
</p>
<div class="org-src-container">

<pre class="src src-bash">awk ' CONDITION_1 { ACTION_1 } ... CONDITION_N { ACTION_N} ' file
</pre>
</div>
<p>
So the previous one-liner become:
</p>
<div class="org-src-container">

<pre class="src src-bash">awk ' $0 ~ /pattern/ { print $0 }' file
</pre>
</div>
<p>
But it's not enough! We also know from theory that every regular expression
is implicitly applied by Awk to $0; moreover, we know the default action
applied to a true condition without specified actions is 'print' ($0 is a
redundant option since 'print' alone by default print '$0').
I omit all these working intermidiate steps and come to the point:
</p>
<div class="org-src-container">

<pre class="src src-bash"># This command emulates 'grep'
awk '/pattern/' file
</pre>
</div>
<p>
Really more readable and typing saving than our first try.
</p>

<p>
And if you want to print all lines that does not match a pattern:
</p>
<div class="org-src-container">

<pre class="src src-bash"># This command emulates 'grep -v'
awk '!/pattern/' file
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="sec-6-0-2-1" name="sec-6-0-2-1"></a>Exercises:<br  /><div class="outline-text-5" id="text-6-0-2-1">
<ol class="org-ol">
<li>Print lines that match both pattern1 AND pattern2
</li>
<li>Print lines that match pattern1 BUT NOT pattern2
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-6-0-3" class="outline-4">
<h4 id="sec-6-0-3"><span class="section-number-4">6.0.3</span> Print lines in range</h4>
<div class="outline-text-4" id="text-6-0-3">
<div class="org-src-container">

<pre class="src src-bash"># NR: The total number of input records seen so far.
# Print from line 3 to line 7 (inclusive)
awk 'NR==3,NR==7'

# Print lines between to regular expression (inclusive)
awk '/beginregex/,/endregex/'

# Print lines between to regular expression (not inclusive)
awk '/endregex/{p=0}; p; /beginregex/{p=1}/
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="sec-6-0-3-1" name="sec-6-0-3-1"></a>Exercises:<br  /><div class="outline-text-5" id="text-6-0-3-1">
<ol class="org-ol">
<li>Print lines from beginregex to endregex, excluding beginregex.
</li>
<li>Print lines from beginregex to endregex, excluding endregex.
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-6-0-4" class="outline-4">
<h4 id="sec-6-0-4"><span class="section-number-4">6.0.4</span> Remove (non consecutive) duplicated lines</h4>
<div class="outline-text-4" id="text-6-0-4">
<div class="org-src-container">

<pre class="src src-bash">awk '!z[$0]++' file
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="sec-6-0-4-1" name="sec-6-0-4-1"></a>Exercises:<br  /><div class="outline-text-5" id="text-6-0-4-1">
<ol class="org-ol">
<li>Remove duplicated lines only if these lines are consecutive.
(Emulates uniq command)
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-6-0-5" class="outline-4">
<h4 id="sec-6-0-5"><span class="section-number-4">6.0.5</span> Find and replace</h4>
<div class="outline-text-4" id="text-6-0-5">
<div class="org-src-container">

<pre class="src src-bash"># Find and replace only the first occurrence
awk '{sub("pattern","replacement")} 1'
# Find and replace all occurrences
awk '{gsub("pattern","replacement")} 1'
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="sec-6-0-5-1" name="sec-6-0-5-1"></a>Exercises:<br  /><div class="outline-text-5" id="text-6-0-5-1">
<ol class="org-ol">
<li>Print only the lines where a replacement occurs.
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-6-0-6" class="outline-4">
<h4 id="sec-6-0-6"><span class="section-number-4">6.0.6</span> Print intersection of two files</h4>
<div class="outline-text-4" id="text-6-0-6">
<p>
This is a really common and powerful construct in Awk.
</p>
<div class="org-src-container">

<pre class="src src-bash"># Print only the lines that are both in file1 and file2
awk 'FNR==NR{ z[$0]++; next } $0 in z' file1 file2
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-0-7" class="outline-4">
<h4 id="sec-6-0-7"><span class="section-number-4">6.0.7</span> Parse a CSV file</h4>
<div class="outline-text-4" id="text-6-0-7">
<div class="org-src-container">

<pre class="src src-bash"># With the flag -F you can set the Input Field Separator (IFS)
# If the separator is comma "," you can write something like:
awk -F, '{ print $1,$3 }' file.csv

NOTE: In this case we have set IFS=, but when we print, as you already know,
there are spaces between fields and not commas! This is not desirable if we,
after some manipulation, want to have again a csv file as output.
Sure, we can print explicitly all commas:
awk -F, '{ print $1","$3 }' file.csv

# However, this is not a good solution.
# In many situation is preferable set the Output Field Separator (OFS):
awk -F, '{ print $1,$3 }' OFS=, file.csv
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Project example: dice rolling simulations</h2>
<div class="outline-text-2" id="text-7">
<p>
I choose this example because it's simple and everyone has experience of
dice rolling; moreover, I write the program in C++ because there are several
courses that cover this language and I hope you are familiar with it.
The C++ code I wrote is straightforward, so you can focus on:
</p>
<ul class="org-ul">
<li>how to pass different arguments to a program
</li>
<li>how to redirect program's output to specific files
</li>
<li>how to manipulate output files
</li>
</ul>

<p>
You can find the program's code in the <i>project:dice</i> subfolder of this seminar
repository. Compile. Run. An usage message should be returned:
Usage: ./dice &lt;dice number&gt; &lt;faces number&gt; &lt;rolls number&gt;
</p>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Not covered by this talk but truly useful and important:</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> ssh</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Some tips to improve your experience.
</p>
</div>
<div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> Generate public/private key pair for authentication</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
You can generate SSH keys with the command:
</p>
<div class="org-src-container">

<pre class="src src-bash">ssh-keygen
</pre>
</div>
<p>
Once you have a key pair you have to append your public key in the file
'~/.ssh/authorized<sub>keys'</sub> on your remote host, you can do it manually or with
the command:
</p>
<div class="org-src-container">

<pre class="src src-bash">ssh-copy-id -i ~/.ssh/id_rsa.pub user@domain
</pre>
</div>
</div>
</div>
