openlab.org
*** Basic configuration example
    Create file ~/.ssh/config (or edit it if you already have one).
    A basic configuration file looks like:
    #+BEGIN_SRC
    Host *
    ControlMaster auto
    ControlPath ~/.ssh/master-%r@%h:%p

    Host mylab
    Hostname mylab.example
    User mylogin
    CheckHostIP no
    Compression yes
    Protocol 2
    #+END_SRC
    From now on, when you want to open a connection via ssh just type:
    #+BEGIN_SRC bash
    ssh mylab
    #+END_SRC
    When you connect the first time ControlMaster create a socket and from the
    second time you don't need to reinsert your password or key's passphrase (if
    you have set one). Note that you can configure multiple hosts and add or
    remove options as you like to fit your needs.
** git
   Love it! Never again without!
   I truly recommend you to inform on this irreplaceable tool!
** tmux
   Tmux is a terminal multiplexer.
