openlab.html
<div id="outline-container-sec-8-1-2" class="outline-4">
<h4 id="sec-8-1-2"><span class="section-number-4">8.1.2</span> Basic configuration example</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
Create file ~/.ssh/config (or edit it if you already have one).
A basic configuration file looks like:
</p>
<pre class="example">
Host *
ControlMaster auto
ControlPath ~/.ssh/master-%r@%h:%p

Host mylab
Hostname mylab.example
User mylogin
CheckHostIP no
Compression yes
Protocol 2
</pre>
<p>
From now on, when you want to open a connection via ssh just type:
</p>
<div class="org-src-container">

<pre class="src src-bash">ssh mylab
</pre>
</div>
<p>
When you connect the first time ControlMaster create a socket and from the
second time you don't need to reinsert your password or key's passphrase (if
you have set one). Note that you can configure multiple hosts and add or
remove options as you like to fit your needs.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> git</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Love it! Never again without!
I truly recommend you to inform on this irreplaceable tool!
</p>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> tmux</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Tmux is a terminal multiplexer.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017.05.10</p>
<p class="author">Author: Andrea Miglietta</p>
<p class="date">Created: 2017-05-10 Wed 14:42</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
